In [1]:
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [0]:
import pandas as pd
import numpy as np

In [0]:
import matplotlib.pyplot as  plt

In [0]:
%matplotlib inline

In [0]:
df=pd.read_csv("/content/Data.csv")

In [8]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

**Count number of elements in each column**

In [9]:
df.count()

Country      10
Age           9
Salary        9
Purchased    10
dtype: int64

**Value_Counts -- Count frequency of each content in a column**

In [12]:
df['Country'].value_counts()

France     4
Germany    3
Spain      3
Name: Country, dtype: int64

**Convert dataframe into array--All execpt last output column**

Get feature vectors into array

In [0]:
x=df.iloc[:,:-1].values

In [47]:
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [0]:
y=df.iloc[:,-1].values

In [18]:
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

**Replace missing data using mean on dataframe**

In [0]:
df['Age'].fillna((df['Age'].mean()), inplace=True)

In [23]:
df

   Country        Age   Salary Purchased
0   France  44.000000  72000.0        No
1    Spain  27.000000  48000.0       Yes
2  Germany  30.000000  54000.0        No
3    Spain  38.000000  61000.0        No
4  Germany  40.000000      NaN       Yes
5   France  35.000000  58000.0       Yes
6    Spain  38.777778  52000.0        No
7   France  48.000000  79000.0       Yes
8  Germany  50.000000  83000.0        No
9   France  37.000000  67000.0       Yes

In [0]:
df=df.astype({"Age": int})

In [32]:
df

   Country  Age   Salary Purchased
0   France   44  72000.0        No
1    Spain   27  48000.0       Yes
2  Germany   30  54000.0        No
3    Spain   38  61000.0        No
4  Germany   40      NaN       Yes
5   France   35  58000.0       Yes
6    Spain   38  52000.0        No
7   France   48  79000.0       Yes
8  Germany   50  83000.0        No
9   France   37  67000.0       Yes

In [33]:
df.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

**Fill Missing values with mean on array**

In [0]:
from sklearn.impute import SimpleImputer

In [0]:
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')
imputer=imputer.fit(x[:,1:3])
x[:,1:3]=imputer.transform(x[:,1:3])

In [49]:
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

**LabelEncoder,  Convert Text to numbers**

In [0]:
from sklearn.preprocessing import LabelEncoder

In [0]:
labelencoder_X=LabelEncoder()

In [0]:
x[:,0]=labelencoder_X.fit_transform(x[:,0])

In [54]:
x

array([[0, 44.0, 72000.0],
       [2, 27.0, 48000.0],
       [1, 30.0, 54000.0],
       [2, 38.0, 61000.0],
       [1, 40.0, 63777.77777777778],
       [0, 35.0, 58000.0],
       [2, 38.77777777777778, 52000.0],
       [0, 48.0, 79000.0],
       [1, 50.0, 83000.0],
       [0, 37.0, 67000.0]], dtype=object)

It will consider these values as continuous numbers..Though they are not.
They are categorical values..We need to think sometghing about them.
Spain greater than germany..Doesn't make any sense

In [0]:
So use Dummy Encoding.Use One Hot encoding.

In [0]:
from sklearn.preprocessing import OneHotEncoder

In [0]:
onehotencoder=OneHotEncoder()